Tekla Open API Reference for Tekla Structures 2025
AngleDimension Constructor (ViewBase, Point, Vector, Vector, Double, AngleDimensionAttributes)
 Creates a new angle dimension instance using the origin and two vectors relative to the origin.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AngleDimension(
	ViewBase View,
	Point Origin,
	Vector Vector1,
	Vector Vector2,
	double Distance,
	AngleDimensionAttributes Attributes
)
Public Sub New (
	View As ViewBase,
	Origin As Point,
	Vector1 As Vector,
	Vector2 As Vector,
	Distance As Double,
	Attributes As AngleDimensionAttributes
)
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
Origin
Type: Tekla.Structures.Geometry3d.Point
The origin to be used.
Vector1
Type: Tekla.Structures.Geometry3d.Vector
The first vector to be used.
Vector2
Type: Tekla.Structures.Geometry3d.Vector
The second vector to be used.
Distance
Type: System.Double
The distance to be used.
Attributes
Type: Tekla.Structures.Drawing.AngleDimensionAttributes
The angle dimension attributes to be used.
See Also
Reference
AngleDimension Class
AngleDimension Overload
Tekla.Structures.Drawing Namespace